# Sales Data Analysis

## Imports

In [1]:
import pandas as pd
import numpy as np

## Read in dataset

In [2]:
# Data provided by https://www.superdatascience.com/
df = pd.read_csv("./OfficeSupplies.csv")

## General analysis on dataset

In [3]:
df.shape

(43, 6)

In [4]:
df.head()

     OrderDate   Region      Rep     Item  Units  Unit Price
0   4-Jul-2014     East  Richard  Pen Set     62        4.99
1  12-Jul-2014     East     Nick   Binder     29        1.99
2  21-Jul-2014  Central   Morgan  Pen Set     55       12.49
3  29-Jul-2014     East    Susan   Binder     81       19.99
4   7-Aug-2014  Central  Matthew  Pen Set     42       23.95

In [5]:
df.dtypes

OrderDate      object
Region         object
Rep            object
Item           object
Units           int64
Unit Price    float64
dtype: object

In [6]:
df.describe()

           Units  Unit Price
count  43.000000   43.000000
mean   49.325581   20.308605
std    30.078248   47.345118
min     2.000000    1.290000
25%    27.500000    3.990000
50%    53.000000    4.990000
75%    74.500000   17.990000
max    96.000000  275.000000

In [7]:
df.isnull().values.any()

False

## Reps who sold the most units

In [8]:
df.groupby(["Rep"]).sum()

         Units  Unit Price
Rep
Alex       281       39.95
Bill       213       40.55
James      142      299.97
Matthew    193      173.93
Morgan     173       26.47
Nick       125        6.98
Rachel     183       10.26
Richard    396       55.92
Smith      156      141.29
Susan      170       55.97
Thomas      89       21.98

## Add a new column to our dataset

In [9]:
df["Total Price"] = df["Units"] * df["Unit Price"]
df.head()

     OrderDate   Region      Rep     Item  Units  Unit Price  Total Price
0   4-Jul-2014     East  Richard  Pen Set     62        4.99       309.38
1  12-Jul-2014     East     Nick   Binder     29        1.99        57.71
2  21-Jul-2014  Central   Morgan  Pen Set     55       12.49       686.95
3  29-Jul-2014     East    Susan   Binder     81       19.99      1619.19
4   7-Aug-2014  Central  Matthew  Pen Set     42       23.95      1005.90

## Additional analysis

### Who sold the most?

In [10]:
df.groupby("Rep").sum().sort_values("Total Price", ascending=False).head()

         Units  Unit Price  Total Price
Rep
Matthew    193      173.93      3109.44
Susan      170       55.97      3102.30
Alex       281       39.95      2812.19
Richard    396       55.92      2363.04
Bill       213       40.55      1749.87

### Who sold the most units?

In [11]:
df.groupby("Rep").sum().sort_values("Units", ascending=False).head()

         Units  Unit Price  Total Price
Rep
Richard    396       55.92      2363.04
Alex       281       39.95      2812.19
Bill       213       40.55      1749.87
Matthew    193      173.93      3109.44
Rachel     183       10.26       438.37

### What region sold the most?

In [12]:
df.groupby("Region").sum()

         Units  Unit Price  Total Price
Region
Central   1199      432.45     11139.07
East       691      118.87      6002.09
West       231      321.95      2486.72

### What item sold the most?

In [13]:
df.groupby("Item").sum()

         Units  Unit Price  Total Price
Item
Binder     722      172.86      9577.65
Desk        10      525.00      1700.00
Pen        278       55.95      2045.22
Pen Set    395       83.39      4169.87
Pencil     716       36.07      2135.14